10/data/attachments/6ad11a725b59560e.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Erica_ready_Friend_87438_6</nif:username>
            <nif:friendToBeRequested>soap_friends_2935d071-2063-4a52-a53a-1e27dd4dfeea</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>